// 1 - Дано натуральное число n. Выведите все числа от 1 до n.

// let array = (n) => {
//     for (let i = 1; i <= n; i++) {
//         console.log(i);
//     }
// };
// array(10)

// ----------------------------------------------------------------------

// 2 - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let array = (a, b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             console.log(i);
//         }
//     } else if (a > b) {
//         for (let i = a; i >= b; i--) {
//             console.log(i)
//         }
//     } else {
//         console.log('ваши числа одинаковые')
//     }
// };
// array(10, 10);

// ----------------------------------------------------------------------

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// let arrayAndNumber = (array, num) => {
//     console.log(array);
//     for (let i = num; i < array.length; i++) {
//         if (i === num) {
//             let element = array[i];
//             array[i] = array[i + 1];
//             array[i + 1] = element;
//             console.log(array);
//         }
//     }
//
//
// };
//
// arrayAndNumber([9,8,0,4], 2)

// ----------------------------------------------------------------------

// Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]

// let transferOfElements = (array) => {
//     console.log(array);
//
//     let newArray = [];
//
//
//     for (let i = 0; i < array.length; i++) {
//         if (array[i] !== 0) {
//             newArray.push(array[i]);
//         }
//     }
//
//     for (let i = 0; i < array.length; i++) {
//         if (array[i] === 0) {
//             newArray.push(array[i]);
//         }
//     }
//     console.log(newArray);
// };
//
// transferOfElements([0, 0, 100, 15, 0, 55, 0, 15, 20, 30]);

// ----------------------------------------------------------------------


