// // 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
//
// let array = [
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
//     Math.floor(Math.random() * 10),
// ];
// const result = array[0] + array[1] + array[2] + array[3] + array[4] + array[5] + array[6] + array[7] + array[8] + array[9];
//
// console.log(array);
// console.log(result);
//
// ___________________________________________________________________________________________________

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

// let book = {
//     title: 'Harry Potter',
//     page: 350,
//     genre: 'Fantasy'
// }
// console.log(book);

// ___________________________________________________________________________________________________

// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

//  let book = {
//     title: 'Harry Potter',
//     page: 350,
//     genre: 'Fantasy',
//     author: 'Joanne Rowling'
// }
// console.log(book);

// ___________________________________________________________________________________________________

// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let books = [
//     {
//     title: 'Harry Potter',
//     page: 350,
//     genre: 'fantasy',
//     author: 'Joanne Rowling'
// },
//     {
//         title: 'Sherlock Holmes',
//         page: 289,
//         genre: 'detective',
//         author: 'Arthur Conan Doyle'
//     }
// ]
// console.log(books);
// console.log(books[0]);
// console.log(books[1]);

// ___________________________________________________________________________________________________

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let height = 23;
// let width = 10;
// let s = (height*width);
//
// console.log('Высота прямоугольника', height, 'см')
// console.log('Ширина прямоугольника', width, 'см')
// console.log('Площадь прямоугольника', s, 'см')

// ___________________________________________________________________________________________________

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let heightC = 10;
// let dC = 4;
// let pi = 3.14;
// let v = (pi*(Math.pow(dC, 2))*heightC);
//
// console.log('Высота цилиндра', heightC, 'м')
// console.log('Диаметр цилинда', dC, 'м')
// console.log('Объем цилиндра', v, 'м')

// ___________________________________________________________________________________________________

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let n = 3;
// let m = 4;
// let hypotenuse= Math.sqrt((Math.pow(n, 2))+(Math.pow(m, 2)));
// console.log(hypotenuse)

// ___________________________________________________________________________________________________