// Всі функції повинні бути описані стрілочним типом!!!!

// 1 - створити функцію яка обчислює та повертає площу прямокутника висотою

// let areaRectangle = (a, b) => a * b;
//
// console.log('площадь прямоугольника =', areaRectangle(10, 5));

// ----------------------------------------------------------------------

// 2 - створити функцію яка обчислює та повертає площу кола

// let areaCircle = (pi, r) => pi * Math.pow(r, 2);
//
// console.log('площадь круга =', areaCircle(3.14, 5));

// ----------------------------------------------------------------------

// 3 - створити функцію яка обчислює та повертає площу циліндру

// let areaCylinder = (pi, h, r) => 2 * pi * r * (h * r);
//
// console.log('площадь цилиндра =', areaCylinder(3.14, 10, 5));

// ----------------------------------------------------------------------

// 4 - створити функцію яка приймає масив та виводить кожен його елемент

// Первый вариант:

// let displayElements = (array) => {
//     for (let arrayElement of array) console.log(arrayElement);
// }
// displayElements([10, 20, 30, 40, 50]);

// Второй вариант: пришлось поискать в гугле и не мог сразу понять его принцип работы.

// let displayElements = [10, 20, 30, 40, 50];
// displayElements.forEach(number => console.log(number));

// ----------------------------------------------------------------------

// 5 - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

// let paragraphText = (text) => document.write(text);
//
// paragraphText('текст для параграфа');

// ----------------------------------------------------------------------

// 6 - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// let threeElements = (text) => document.write(`<ul> <li><p> ${text}</p</li> <li><p> ${text}</p</li> <li><p> ${text}</p</li> </ul>`);
//
// threeElements('текст для параграфа');

// ----------------------------------------------------------------------

// 7 - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// let threeElementsAndLimit = (text, limit) => {
//     document.write(`<ul>`);
//     for (let i  = 0; i < limit; i++){
//         document.write(`<li> ${text} </li>`);
//     }
//     document.write(`</ul>`);
// }
//
// threeElementsAndLimit('текст для параграфа', 3);

// ----------------------------------------------------------------------

// 8 - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// let arrayOfPrimitiveElements = (array) => {
//     document.write(`<ul>`);
//     for (let element of array) {
//         document.write(`<li> ${element} </li>`);
//     }
//     document.write(`</ul>`);
// };
//
// arrayOfPrimitiveElements([10, 20, 'string', true, false]);

// ----------------------------------------------------------------------

// 9 - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

// let arrayOfObjects = (array) => {
//     for (let element of array) {
//         document.write(`<div>`);
//         document.write(`<p> ${element.id}: ${element.name} - ${element.age} </p>`);
//         document.write(`</div>`);
//     }
// };
//
// arrayOfObjects([{id: 1, name: 'sergey', age: 37}, {id: 2, name: 'alena', age: 38}, {id: 3, name: 'evgeniy', age: 8}])
